> After many tries it is not possible to replicate this issue and everything worked as expected without errors. I'm forwarding it to the service team for a deep review

@ggtisc I had an alert policy which I realized is not a big issue, if it's missing for a bit. So I destroyed it, and then tried to recreate it with terraform. This fails:

Resource:
```
resource "google_monitoring_alert_policy" "kubernetes-high-volume-utilization" {
  alert_strategy {
    notification_prompts = ["OPENED"]
  }

  combiner = "OR"

  conditions {
    condition_threshold {
      aggregations {
        alignment_period   = "300s"
        per_series_aligner = "ALIGN_MEAN"
      }

      comparison      = "COMPARISON_GT"
      duration        = "0s"
      filter          = "resource.type = \"k8s_pod\" AND metric.type = \"kubernetes.io/pod/volume/utilization\""
      threshold_value = "0.8"

      trigger {
        count   = "1"
        percent = "0"
      }
    }

    display_name = "Kubernetes Pod - Volume utilization"
  }

  display_name = "kubernetes pod utilization"

  documentation {
    subject = "Kubernetes Volume utilization"
    mime_type = "text/plain"
  }

  enabled               = "true"
  notification_channels = [google_monitoring_notification_channel.slack.name]
  project               = var.project
}
```

Applying:
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.monitoring.google_monitoring_alert_policy.kubernetes-high-volume-utilization will be created
  + resource "google_monitoring_alert_policy" "kubernetes-high-volume-utilization" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "kubernetes pod utilization"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/flowscan-api/notificationChannels/2981319469890083505",
        ]
      + project               = "flowscan-api"

      + alert_strategy {
          + notification_prompts = [
              + "OPENED",
            ]
        }

      + conditions {
          + display_name = "Kubernetes Pod - Volume utilization"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "0s"
              + filter          = "resource.type = \"k8s_pod\" AND metric.type = \"kubernetes.io/pod/volume/utilization\""
              + threshold_value = 0.8

              + aggregations {
                  + alignment_period   = "300s"
                  + per_series_aligner = "ALIGN_MEAN"
                }

              + trigger {
                  + count   = 1
                  + percent = 0
                }
            }
        }

      + documentation {
          + mime_type = "text/plain"
          + subject   = "Kubernetes Volume utilization"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Resource targeting is in effect
│
│ You are creating a plan with the -target option, which means that the result of this plan may not represent all of the changes requested by the current configuration.
│
│ The -target option is not for routine use, and is provided only for exceptional situations such as recovering from errors or mistakes, or when Terraform specifically suggests to use it as part of an error message.
╵

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.monitoring.google_monitoring_alert_policy.kubernetes-high-volume-utilization: Creating...
╷
│ Warning: Applied changes may be incomplete
│
│ The plan was created with the -target option in effect, so some changes requested in the configuration may have been ignored and the output values may not be fully updated. Run the following command to verify that no other changes
│ are pending:
│     terraform plan
│
│ Note that the -target option is not suitable for routine use, and is provided only for exceptional situations such as recovering from errors or mistakes, or when Terraform specifically suggests to use it as part of an error
│ message.
╵
╷
│ Error: Error creating AlertPolicy: googleapi: Error 400: Request was missing field alert_policy.documentation.mime_type: non-empty content requires non-empty MIME type and vice versa.
│
│   with module.monitoring.google_monitoring_alert_policy.kubernetes-high-volume-utilization,
│   on modules/monitoring/main.tf line 52, in resource "google_monitoring_alert_policy" "kubernetes-high-volume-utilization":
│   52: resource "google_monitoring_alert_policy" "kubernetes-high-volume-utilization" {
```

I also tried with mime_type not set, mime_type set to null and mime_type set to something else (`text/markdown`). It doesn't seem to be possible to create from terraform.